GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32f307r(g-e-c)xx-pinctrl.h
/* ENET_MII_RXD2 */
#define ENET_MII_RXD2_PB0_NORMP \
	GD32_PINMUX_AFIO('B', 0, GPIO_IN, ENET_NORMP)

/* ENET_MII_RXD3 */
#define ENET_MII_RXD3_PB1_NORMP \
	GD32_PINMUX_AFIO('B', 1, GPIO_IN, ENET_NORMP)

/* ENET_MII_RX_CLK */
#define ENET_MII_RX_CLK_PA1 \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, NORMP)

/* ENET_MII_RX_DV */
#define ENET_MII_RX_DV_PA7_NORMP \
	GD32_PINMUX_AFIO('A', 7, GPIO_IN, ENET_NORMP)

/* ENET_MII_RX_ER */
#define ENET_MII_RX_ER_PB10 \
	GD32_PINMUX_AFIO('B', 10, GPIO_IN, NORMP)

/* ENET_MII_TXD0 */
#define ENET_MII_TXD0_PB12 \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* ENET_MII_TXD1 */
#define ENET_MII_TXD1_PB13 \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* ENET_MII_TXD2 */
#define ENET_MII_TXD2_PC2 \
	GD32_PINMUX_AFIO('C', 2, ALTERNATE, NORMP)

/* ENET_MII_TXD3 */
#define ENET_MII_TXD3_PB8 \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, NORMP)

/* ENET_MII_TX_CLK */
#define ENET_MII_TX_CLK_PC3 \
	GD32_PINMUX_AFIO('C', 3, ALTERNATE, NORMP)

/* ENET_MII_TX_EN */
#define ENET_MII_TX_EN_PB11 \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, NORMP)

/* ENET_RMII_CRS_DV */
#define ENET_RMII_CRS_DV_PA7_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, ENET_NORMP)

/* ENET_RMII_PPS_OUT */
#define ENET_RMII_PPS_OUT_PB5 \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)

/* ENET_RMII_REF_CLK */
#define ENET_RMII_REF_CLK_PA1 \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, NORMP)

/* ENET_RMII_RXD0 */
#define ENET_RMII_RXD0_PC4_NORMP \
	GD32_PINMUX_AFIO('C', 4, GPIO_IN, ENET_NORMP)

/* ENET_RMII_RXD1 */
#define ENET_RMII_RXD1_PC5_NORMP \
	GD32_PINMUX_AFIO('C', 5, GPIO_IN, ENET_NORMP)

/* ENET_RMII_TXD0 */
#define ENET_RMII_TXD0_PB12 \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* ENET_RMII_TXD1 */
#define ENET_RMII_TXD1_PB13 \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* ENET_RMII_TX_EN */
#define ENET_RMII_TX_EN_PB11 \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, NORMP)

/* EXMC_NADV */
#define EXMC_NADV_PB7 \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, NORMP)

/* I2C0_SCL */
#define I2C0_SCL_PB6_NORMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, I2C0_NORMP)
#define I2C0_SCL_PB8_NORMP \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, I2C0_NORMP)
#define I2C0_SCL_PB8_RMP \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, I2C0_RMP)

/* I2C0_SDA */
#define I2C0_SDA_PB7_NORMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, I2C0_NORMP)
#define I2C0_SDA_PB9_NORMP \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, I2C0_NORMP)
#define I2C0_SDA_PB9_RMP \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, I2C0_RMP)

/* I2C0_SMBA */
#define I2C0_SMBA_PB5 \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)

/* I2C1_SCL */
#define I2C1_SCL_PB10 \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, NORMP)

/* I2C1_SDA */
#define I2C1_SDA_PB11 \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, NORMP)

/* I2C1_SMBA */
#define I2C1_SMBA_PB12 \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* I2S1_CK */
#define I2S1_CK_PB13 \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* I2S1_MCK */
#define I2S1_MCK_PC6_INP \
	GD32_PINMUX_AFIO('C', 6, GPIO_IN, NORMP)
#define I2S1_MCK_PC6_OUT \
	GD32_PINMUX_AFIO('C', 6, ALTERNATE, NORMP)

/* I2S1_SD */
#define I2S1_SD_PB15_INP \
	GD32_PINMUX_AFIO('B', 15, GPIO_IN, NORMP)
#define I2S1_SD_PB15_OUT \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, NORMP)

/* I2S1_WS */
#define I2S1_WS_PB12_INP \
	GD32_PINMUX_AFIO('B', 12, GPIO_IN, NORMP)
#define I2S1_WS_PB12_OUT \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* I2S2_CK */
#define I2S2_CK_PB3_NORMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, I2S2_NORMP)
#define I2S2_CK_PC10_NORMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, I2S2_NORMP)
#define I2S2_CK_PC10_RMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, I2S2_RMP)

/* I2S2_MCK */
#define I2S2_MCK_PC7_INP \
	GD32_PINMUX_AFIO('C', 7, GPIO_IN, NORMP)
#define I2S2_MCK_PC7_OUT \
	GD32_PINMUX_AFIO('C', 7, ALTERNATE, NORMP)

/* I2S2_SD */
#define I2S2_SD_PB5_INP_NORMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, I2S2_NORMP)
#define I2S2_SD_PB5_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, I2S2_NORMP)
#define I2S2_SD_PC12_INP_NORMP \
	GD32_PINMUX_AFIO('C', 12, GPIO_IN, I2S2_NORMP)
#define I2S2_SD_PC12_OUT_NORMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, I2S2_NORMP)
#define I2S2_SD_PC12_INP_RMP \
	GD32_PINMUX_AFIO('C', 12, GPIO_IN, I2S2_RMP)
#define I2S2_SD_PC12_OUT_RMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, I2S2_RMP)

/* I2S2_WS */
#define I2S2_WS_PA4_INP_NORMP \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, I2S2_NORMP)
#define I2S2_WS_PA4_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, I2S2_NORMP)
#define I2S2_WS_PA4_INP_RMP \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, I2S2_RMP)
#define I2S2_WS_PA4_OUT_RMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, I2S2_RMP)
#define I2S2_WS_PA15_INP_NORMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, I2S2_NORMP)
#define I2S2_WS_PA15_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, I2S2_NORMP)

/* OSC32IN */
#define OSC32IN_PC14 \
	GD32_PINMUX_AFIO('C', 14, GPIO_IN, NORMP)

/* OSC32OUT */
#define OSC32OUT_PC15 \
	GD32_PINMUX_AFIO('C', 15, GPIO_IN, NORMP)

/* PA13 */
#define PA13_PA13 \
	GD32_PINMUX_AFIO('A', 13, ALTERNATE, NORMP)

/* PA14 */
#define PA14_PA14 \
	GD32_PINMUX_AFIO('A', 14, ALTERNATE, NORMP)

/* PA15 */
#define PA15_PA15 \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, NORMP)

/* SPI0_IO2 */
#define SPI0_IO2_PA2_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, SPI0_NORMP)
#define SPI0_IO2_PB6_NORMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, SPI0_NORMP)
#define SPI0_IO2_PB6_RMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, SPI0_RMP)

/* SPI0_IO3 */
#define SPI0_IO3_PA3_NORMP \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, SPI0_NORMP)
#define SPI0_IO3_PB7_NORMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, SPI0_NORMP)
#define SPI0_IO3_PB7_RMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, SPI0_RMP)

/* SPI0_MISO */
#define SPI0_MISO_PA6_NORMP \
	GD32_PINMUX_AFIO('A', 6, GPIO_IN, SPI0_NORMP)
#define SPI0_MISO_PB4_NORMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, SPI0_NORMP)
#define SPI0_MISO_PB4_RMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, SPI0_RMP)

/* SPI0_MOSI */
#define SPI0_MOSI_PA7_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, SPI0_NORMP)
#define SPI0_MOSI_PB5_NORMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, SPI0_NORMP)
#define SPI0_MOSI_PB5_RMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, SPI0_RMP)

/* SPI0_NSS */
#define SPI0_NSS_PA4_NORMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, SPI0_NORMP)
#define SPI0_NSS_PA15_NORMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, SPI0_NORMP)
#define SPI0_NSS_PA15_RMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, SPI0_RMP)

/* SPI0_SCK */
#define SPI0_SCK_PA5_NORMP \
	GD32_PINMUX_AFIO('A', 5, ALTERNATE, SPI0_NORMP)
#define SPI0_SCK_PB3_NORMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, SPI0_NORMP)
#define SPI0_SCK_PB3_RMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, SPI0_RMP)

/* SPI1_MISO */
#define SPI1_MISO_PB14 \
	GD32_PINMUX_AFIO('B', 14, GPIO_IN, NORMP)

/* SPI1_MOSI */
#define SPI1_MOSI_PB15 \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, NORMP)

