GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32f307r(g-e-c)xx-pinctrl.h
/* TIMER2_ETI */
#define TIMER2_ETI_PD2 \
	GD32_PINMUX_AFIO('D', 2, GPIO_IN, NORMP)

/* TIMER3_CH0 */
#define TIMER3_CH0_PB6_NORMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, TIMER3_NORMP)

/* TIMER3_CH1 */
#define TIMER3_CH1_PB7_NORMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, TIMER3_NORMP)

/* TIMER3_CH2 */
#define TIMER3_CH2_PB8_NORMP \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, TIMER3_NORMP)

/* TIMER3_CH3 */
#define TIMER3_CH3_PB9_NORMP \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, TIMER3_NORMP)

/* TIMER4_CH0 */
#define TIMER4_CH0_PA0 \
	GD32_PINMUX_AFIO('A', 0, ALTERNATE, NORMP)

/* TIMER4_CH1 */
#define TIMER4_CH1_PA1 \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, NORMP)

/* TIMER4_CH2 */
#define TIMER4_CH2_PA2 \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, NORMP)

/* TIMER4_CH3 */
#define TIMER4_CH3_PA3 \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, NORMP)

/* TIMER7_BRKIN */
#define TIMER7_BRKIN_PA6 \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, NORMP)

/* TIMER7_CH0 */
#define TIMER7_CH0_PC6 \
	GD32_PINMUX_AFIO('C', 6, ALTERNATE, NORMP)

/* TIMER7_CH0_ON */
#define TIMER7_CH0_ON_PA7 \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, NORMP)

/* TIMER7_CH1 */
#define TIMER7_CH1_PC7 \
	GD32_PINMUX_AFIO('C', 7, ALTERNATE, NORMP)

/* TIMER7_CH1_ON */
#define TIMER7_CH1_ON_PB0 \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, NORMP)

/* TIMER7_CH2 */
#define TIMER7_CH2_PC8 \
	GD32_PINMUX_AFIO('C', 8, ALTERNATE, NORMP)

/* TIMER7_CH2_ON */
#define TIMER7_CH2_ON_PB1 \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, NORMP)

/* TIMER7_CH3 */
#define TIMER7_CH3_PC9 \
	GD32_PINMUX_AFIO('C', 9, ALTERNATE, NORMP)

/* TIMER7_ETI */
#define TIMER7_ETI_PA0 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, NORMP)

/* TIMER8_CH0 */
#define TIMER8_CH0_PA2_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, TIMER8_NORMP)

/* TIMER8_CH1 */
#define TIMER8_CH1_PA3_NORMP \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, TIMER8_NORMP)

/* TIMER9_CH0 */
#define TIMER9_CH0_PB8_NORMP \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, TIMER9_NORMP)

/* TRACESWO */
#define TRACESWO_PB3 \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, NORMP)

/* UART3_RX */
#define UART3_RX_PC11 \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, NORMP)

/* UART3_TX */
#define UART3_TX_PC10 \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, NORMP)

/* UART4_RX */
#define UART4_RX_PD2 \
	GD32_PINMUX_AFIO('D', 2, GPIO_IN, NORMP)

/* UART4_TX */
#define UART4_TX_PC12 \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, NORMP)

/* USART0_CK */
#define USART0_CK_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* USART0_CTS */
#define USART0_CTS_PA11 \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, NORMP)

/* USART0_RTS */
#define USART0_RTS_PA12 \
	GD32_PINMUX_AFIO('A', 12, ALTERNATE, NORMP)

/* USART0_RX */
#define USART0_RX_PA10_NORMP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, USART0_NORMP)
#define USART0_RX_PB7_NORMP \
	GD32_PINMUX_AFIO('B', 7, GPIO_IN, USART0_NORMP)
#define USART0_RX_PB7_RMP \
	GD32_PINMUX_AFIO('B', 7, GPIO_IN, USART0_RMP)

/* USART0_TX */
#define USART0_TX_PA9_NORMP \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, USART0_NORMP)
#define USART0_TX_PB6_NORMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, USART0_NORMP)
#define USART0_TX_PB6_RMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, USART0_RMP)

/* USART1_CK */
#define USART1_CK_PA4_NORMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, USART1_NORMP)

/* USART1_CTS */
#define USART1_CTS_PA0_NORMP \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, USART1_NORMP)

/* USART1_RTS */
#define USART1_RTS_PA1_NORMP \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, USART1_NORMP)

/* USART1_RX */
#define USART1_RX_PA3_NORMP \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, USART1_NORMP)

/* USART1_TX */
#define USART1_TX_PA2_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, USART1_NORMP)

/* USART2_CK */
#define USART2_CK_PB12_NORMP \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, USART2_NORMP)
#define USART2_CK_PC12_NORMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, USART2_NORMP)
#define USART2_CK_PC12_PRMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, USART2_PRMP)

/* USART2_CTS */
#define USART2_CTS_PB13_NORMP \
	GD32_PINMUX_AFIO('B', 13, GPIO_IN, USART2_NORMP)

/* USART2_RTS */
#define USART2_RTS_PB14_NORMP \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, USART2_NORMP)

/* USART2_RX */
#define USART2_RX_PB11_NORMP \
	GD32_PINMUX_AFIO('B', 11, GPIO_IN, USART2_NORMP)
#define USART2_RX_PC11_NORMP \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, USART2_NORMP)
#define USART2_RX_PC11_PRMP \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, USART2_PRMP)

/* USART2_TX */
#define USART2_TX_PB10_NORMP \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, USART2_NORMP)
#define USART2_TX_PC10_NORMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, USART2_NORMP)
#define USART2_TX_PC10_PRMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, USART2_PRMP)

/* USBFS_DM */
#define USBFS_DM_PA11 \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, NORMP)

/* USBFS_DP */
#define USBFS_DP_PA12 \
	GD32_PINMUX_AFIO('A', 12, ALTERNATE, NORMP)

/* USBFS_ID */
#define USBFS_ID_PA10 \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, NORMP)

/* USBFS_SOF */
#define USBFS_SOF_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* USBFS_VBUS */
#define USBFS_VBUS_PA9 \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, NORMP)

/* WKUP */
#define WKUP_PA0 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, NORMP)
